#+TITLE: Emacs config for Pixalesce
#+AUTHOR: Pixalesce
#+DESCRIPTION: The personal Emacs configuration of Pixalesce
#+STARTUP: showeverything #unfolds the entire document on startup
#+OPTIONS: toc:2 #Limits table of contents header levels to 2 deep

* FONTS
Defining fonts that Emacs will use
#+begin_src emacs-lisp
(set-face-attribute 'default nil
  :font "FiraCode Nerd Font Mono"
  :height 110
  :weight 'medium)
(set-face-attribute 'variable-pitch nil ;;non-monospaced fonts
  :font "Helvetica"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "FiraCode Nerd Font Mono"
  :height 110
  :weight 'medium)

;; Makes commented text and keywords italics.
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right unless I also add this method of setting the default font.
(add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font Mono-11"))

(setq-default line-spacing 0.12)
#+end_src

#+RESULTS:
: 0.12
